; https://github.com/seahorn/seahorn/issues/434
; RUN: %fpfsea "%s" -O3 --inline --enable-loop-idiom --enable-indvar --no-lower-gv-init-struct --externalize-addr-taken-functions --no-kill-vaarg --with-arith-overflow=true --horn-unify-assumes=true --horn-gsa --no-fat-fns=bcmp,memcpy,assert_bytes_match,ensure_linked_list_is_allocated,sea_aws_linked_list_is_valid --dsa=sea-cs-t --devirt-functions=types --bmc=opsem --horn-vcgen-use-ite --horn-vcgen-only-dataflow=true --horn-bmc-coi=true --sea-opsem-allocator=static --horn-explicit-sp0=false --horn-bv2-lambdas --horn-bv2-simplify=true --horn-bv2-extra-widemem --bound=10 2>&1 | %oc %s
; CHECK: ^unsat$
; ModuleID = '/tmp/array_eq_c_str_ignore_case.ir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:o-p:32:32-Fi8-f64:32:64-v64:32:64-v128:32:128-a:0:32-n32-S32"
target triple = "armv4t-apple-macosx10.17.0"

%struct.aws_byte_cursor = type { i32, i8* }
%struct.aws_allocator = type { i8* (%struct.aws_allocator*, i32)*, void (%struct.aws_allocator*, i8*)*, i8* (%struct.aws_allocator*, i8*, i32, i32)*, i8* (%struct.aws_allocator*, i32, i32)*, i8* }
%struct.aws_byte_buf = type { i32, i8*, i32, %struct.aws_allocator* }
%struct.aws_array_list = type { %struct.aws_allocator*, i32, i32, i32, i8* }
%struct.store_byte_from_buffer = type { i32, i8 }
%struct.aws_linked_list_node = type { %struct.aws_linked_list_node*, %struct.aws_linked_list_node* }

!9 = !DIEnumerator(name: "AWS_ERROR_SUCCESS", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "AWS_ERROR_OOM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "AWS_ERROR_NO_SPACE", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "AWS_ERROR_UNKNOWN", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "AWS_ERROR_SHORT_BUFFER", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "AWS_ERROR_OVERFLOW_DETECTED", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "AWS_ERROR_UNSUPPORTED_OPERATION", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "AWS_ERROR_INVALID_BUFFER_SIZE", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "AWS_ERROR_INVALID_HEX_STR", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "AWS_ERROR_INVALID_BASE64_STR", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "AWS_ERROR_INVALID_INDEX", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "AWS_ERROR_THREAD_INVALID_SETTINGS", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "AWS_ERROR_THREAD_INSUFFICIENT_RESOURCE", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "AWS_ERROR_THREAD_NO_PERMISSIONS", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "AWS_ERROR_THREAD_NOT_JOINABLE", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "AWS_ERROR_THREAD_NO_SUCH_THREAD_ID", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "AWS_ERROR_THREAD_DEADLOCK_DETECTED", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "AWS_ERROR_MUTEX_NOT_INIT", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "AWS_ERROR_MUTEX_TIMEOUT", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "AWS_ERROR_MUTEX_CALLER_NOT_OWNER", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "AWS_ERROR_MUTEX_FAILED", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "AWS_ERROR_COND_VARIABLE_INIT_FAILED", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "AWS_ERROR_COND_VARIABLE_TIMED_OUT", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "AWS_ERROR_COND_VARIABLE_ERROR_UNKNOWN", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "AWS_ERROR_CLOCK_FAILURE", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "AWS_ERROR_LIST_EMPTY", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "AWS_ERROR_DEST_COPY_TOO_SMALL", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "AWS_ERROR_LIST_EXCEEDS_MAX_SIZE", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "AWS_ERROR_LIST_STATIC_MODE_CANT_SHRINK", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "AWS_ERROR_PRIORITY_QUEUE_FULL", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "AWS_ERROR_PRIORITY_QUEUE_EMPTY", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "AWS_ERROR_PRIORITY_QUEUE_BAD_NODE", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "AWS_ERROR_HASHTBL_ITEM_NOT_FOUND", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "AWS_ERROR_INVALID_DATE_STR", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "AWS_ERROR_INVALID_ARGUMENT", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "AWS_ERROR_RANDOM_GEN_FAILED", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "AWS_ERROR_MALFORMED_INPUT_STRING", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "AWS_ERROR_UNIMPLEMENTED", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "AWS_ERROR_INVALID_STATE", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "AWS_ERROR_ENVIRONMENT_GET", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "AWS_ERROR_ENVIRONMENT_SET", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "AWS_ERROR_ENVIRONMENT_UNSET", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "AWS_ERROR_STREAM_UNSEEKABLE", value: 42, isUnsigned: true)
!52 = !DIEnumerator(name: "AWS_ERROR_NO_PERMISSION", value: 43, isUnsigned: true)
!53 = !DIEnumerator(name: "AWS_ERROR_FILE_INVALID_PATH", value: 44, isUnsigned: true)
!54 = !DIEnumerator(name: "AWS_ERROR_MAX_FDS_EXCEEDED", value: 45, isUnsigned: true)
!55 = !DIEnumerator(name: "AWS_ERROR_SYS_CALL_FAILURE", value: 46, isUnsigned: true)
!56 = !DIEnumerator(name: "AWS_ERROR_C_STRING_BUFFER_NOT_NULL_TERMINATED", value: 47, isUnsigned: true)
!57 = !DIEnumerator(name: "AWS_ERROR_STRING_MATCH_NOT_FOUND", value: 48, isUnsigned: true)
!58 = !DIEnumerator(name: "AWS_ERROR_DIVIDE_BY_ZERO", value: 49, isUnsigned: true)
!59 = !DIEnumerator(name: "AWS_ERROR_END_COMMON_RANGE", value: 1023, isUnsigned: true)
!60 = !{!61, !62, !92, !103, !109, !113, !114, !118, !123, !124, !130, !131, !121, !129, !140, !143, !146, !151, !153, !154, !157, !159, !162, !165, !168, !180, !73, !184, !186, !188, !163, !189}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!62 = !DISubprogram(name: "aws_mem_acquire", scope: !63, file: !63, line: 58, type: !64, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!63 = !DIFile(filename: "aws-c-common/include/aws/common/allocator.h", directory: "/Users/jorge/Repos/verify-c-common")
!64 = !DISubroutineType(types: !65)
!65 = !{!61, !66, !77}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_allocator", file: !63, line: 15, size: 160, elements: !68)
!68 = !{!69, !78, !82, !86, !90}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mem_acquire", scope: !67, file: !63, line: 16, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!71 = !DISubroutineType(types: !72)
!72 = !{!61, !66, !73}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 31, baseType: !75)
!74 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.0.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !76, line: 70, baseType: !77)
!76 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.0.sdk/usr/include/arm/_types.h", directory: "")
!77 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mem_release", scope: !67, file: !63, line: 17, baseType: !79, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !66, !61}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mem_realloc", scope: !67, file: !63, line: 19, baseType: !83, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DISubroutineType(types: !85)
!85 = !{!61, !66, !61, !73, !73}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !67, file: !63, line: 21, baseType: !87, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DISubroutineType(types: !89)
!89 = !{!61, !66, !73, !73}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !67, file: !63, line: 22, baseType: !61, size: 32, offset: 128)
!91 = !{}
!92 = !DISubprogram(name: "aws_byte_buf_is_valid", scope: !93, file: !93, line: 132, type: !94, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!93 = !DIFile(filename: "aws-c-common/include/aws/common/byte_buf.h", directory: "/Users/jorge/Repos/verify-c-common")
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !97}
!96 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_byte_buf", file: !93, line: 25, size: 128, elements: !100)
!100 = !{!101, !102, !107, !108}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !99, file: !93, line: 27, baseType: !73, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !99, file: !93, line: 28, baseType: !103, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !105, line: 31, baseType: !106)
!105 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.0.sdk/usr/include/_types/_uint8_t.h", directory: "")
!106 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !99, file: !93, line: 29, baseType: !73, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !99, file: !93, line: 30, baseType: !66, size: 32, offset: 96)
!109 = !DISubprogram(name: "aws_byte_buf_secure_zero", scope: !93, file: !93, line: 186, type: !110, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!113 = !DISubprogram(name: "aws_mem_release", scope: !63, file: !63, line: 84, type: !80, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!114 = !DISubprogram(name: "aws_secure_zero", scope: !115, file: !115, line: 56, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!115 = !DIFile(filename: "aws-c-common/include/aws/common/zero.h", directory: "/Users/jorge/Repos/verify-c-common")
!116 = !DISubroutineType(types: !117)
!117 = !{null, !61, !77}
!118 = !DISubprogram(name: "aws_array_eq", scope: !93, file: !93, line: 77, type: !119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!119 = !DISubroutineType(types: !120)
!120 = !{!96, !121, !77, !121, !77}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!123 = !DISubprogram(name: "aws_array_eq_ignore_case", scope: !93, file: !93, line: 87, type: !119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!124 = !DISubprogram(name: "aws_array_eq_c_str", scope: !93, file: !93, line: 100, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!125 = !DISubroutineType(types: !126)
!126 = !{!96, !121, !77, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!130 = !DISubprogram(name: "aws_array_eq_c_str_ignore_case", scope: !93, file: !93, line: 111, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!131 = !DISubprogram(name: "aws_byte_buf_append_and_update", scope: !93, file: !93, line: 412, type: !132, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !112, !135}
!134 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_byte_cursor", file: !93, line: 38, size: 64, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !136, file: !93, line: 40, baseType: !73, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !136, file: !93, line: 41, baseType: !103, size: 32, offset: 32)
!140 = !DISubprogram(name: "aws_byte_cursor_advance", scope: !93, file: !93, line: 574, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!141 = !DISubroutineType(types: !142)
!142 = !{!136, !135, !77}
!143 = !DISubprogram(name: "aws_byte_cursor_from_buf", scope: !93, file: !93, line: 558, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!144 = !DISubroutineType(types: !145)
!145 = !{!136, !97}
!146 = !DISubprogram(name: "aws_byte_buf_append", scope: !93, file: !93, line: 345, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!147 = !DISubroutineType(types: !148)
!148 = !{!134, !112, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!154 = !DISubprogram(name: "aws_mem_realloc", scope: !63, file: !63, line: 95, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!155 = !DISubroutineType(types: !156)
!156 = !{!134, !66, !153, !77, !77}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !158, line: 34, baseType: !77)
!158 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.0.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!159 = !DISubprogram(name: "aws_raise_error_private", scope: !6, file: !6, line: 82, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !134}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !164, line: 31, baseType: !7)
!164 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.0.sdk/usr/include/_types/_uint32_t.h", directory: "")
!165 = !DISubprogram(name: "aws_last_error", scope: !6, file: !6, line: 52, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!166 = !DISubroutineType(types: !167)
!167 = !{!134}
!168 = !DISubprogram(name: "aws_array_list_ensure_capacity", scope: !169, file: !169, line: 187, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!169 = !DIFile(filename: "aws-c-common/include/aws/common/array_list.h", directory: "/Users/jorge/Repos/verify-c-common")
!170 = !DISubroutineType(types: !171)
!171 = !{!134, !172, !77}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_array_list", file: !169, line: 15, size: 160, elements: !174)
!174 = !{!175, !176, !177, !178, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !173, file: !169, line: 16, baseType: !66, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "current_size", scope: !173, file: !169, line: 17, baseType: !73, size: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !173, file: !169, line: 18, baseType: !73, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !173, file: !169, line: 19, baseType: !73, size: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !169, line: 20, baseType: !61, size: 32, offset: 128)
!180 = !DISubprogram(name: "aws_fatal_assert", scope: !181, file: !181, line: 17, type: !182, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !91)
!181 = !DIFile(filename: "aws-c-common/include/aws/common/assert.h", directory: "/Users/jorge/Repos/verify-c-common")
!182 = !DISubroutineType(types: !183)
!183 = !{null, !127, !127, !134}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !76, line: 21, baseType: !185)
!185 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !187, line: 31, baseType: !185)
!187 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.0.sdk/usr/include/_types/_uint16_t.h", directory: "")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !76, line: 23, baseType: !7)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !190, line: 31, baseType: !191)
!190 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.0.sdk/usr/include/_types/_uint64_t.h", directory: "")
!191 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!192 = !{!0, !193, !199}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "s_hex_to_num_table", scope: !2, file: !195, line: 1312, type: !196, isLocal: true, isDefinition: true)
!195 = !DIFile(filename: "aws-c-common/source/byte_buf.c", directory: "/Users/jorge/Repos/verify-c-common")
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 2048, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 256)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "s_null_terminator_cursor", scope: !2, file: !195, line: 1596, type: !136, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "s_allocator_static", scope: !203, file: !219, line: 45, type: !220, isLocal: true, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !205, globals: !218, nameTableKind: None)
!204 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/proof_allocators.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!205 = !{!206, !61, !210, !213, !214}
!206 = !DISubprogram(name: "sea_realloc", scope: !207, file: !207, line: 60, type: !208, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!207 = !DIFile(filename: "seahorn/include/sea_allocators.h", directory: "/Users/jorge/Repos/verify-c-common")
!208 = !DISubroutineType(types: !209)
!209 = !{!61, !61, !77}
!210 = !DISubprogram(name: "sea_malloc_havoc_safe", scope: !207, file: !207, line: 43, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!211 = !DISubroutineType(types: !212)
!212 = !{!61, !77}
!213 = !DISubprogram(name: "sea_malloc_havoc", scope: !207, file: !207, line: 29, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!214 = !DISubprogram(name: "free", scope: !215, file: !215, line: 42, type: !216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!215 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.0.sdk/usr/include/malloc/_malloc.h", directory: "")
!216 = !DISubroutineType(types: !217)
!217 = !{null, !61}
!218 = !{!201}
!219 = !DIFile(filename: "seahorn/lib/proof_allocators.c", directory: "/Users/jorge/Repos/verify-c-common")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_allocator", file: !63, line: 15, size: 160, elements: !221)
!221 = !{!222, !227, !231, !235, !239}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mem_acquire", scope: !220, file: !63, line: 16, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DISubroutineType(types: !225)
!225 = !{!61, !226, !73}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mem_release", scope: !220, file: !63, line: 17, baseType: !228, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !226, !61}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mem_realloc", scope: !220, file: !63, line: 19, baseType: !232, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DISubroutineType(types: !234)
!234 = !{!61, !226, !61, !73, !73}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !220, file: !63, line: 21, baseType: !236, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DISubroutineType(types: !238)
!238 = !{!61, !226, !73, !73}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !220, file: !63, line: 22, baseType: !61, size: 32, offset: 128)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "tl_last_error", scope: !242, file: !245, line: 3, type: !134, isLocal: true, isDefinition: true)
!242 = distinct !DICompileUnit(language: DW_LANG_C99, file: !243, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, globals: !244, nameTableKind: None)
!243 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/error_override.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!244 = !{!240}
!245 = !DIFile(filename: "seahorn/lib/error_override.c", directory: "/Users/jorge/Repos/verify-c-common")
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !248, nameTableKind: None)
!247 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/jobs/array_eq_c_str_ignore_case/aws_array_eq_c_str_ignore_case_harness.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/jobs/array_eq_c_str_ignore_case")
!248 = !{!249, !253, !255, !103, !260, !130, !271}
!249 = !DISubprogram(name: "nd_size_t", scope: !250, file: !250, line: 20, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!250 = !DIFile(filename: "seahorn/include/nondet.h", directory: "/Users/jorge/Repos/verify-c-common")
!251 = !DISubroutineType(types: !252)
!252 = !{!77}
!253 = !DISubprogram(name: "can_fail_malloc", scope: !254, file: !254, line: 29, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!254 = !DIFile(filename: "seahorn/include/proof_allocators.h", directory: "/Users/jorge/Repos/verify-c-common")
!255 = !DISubprogram(name: "ensure_c_str_is_nd_allocated_safe", scope: !256, file: !256, line: 11, type: !257, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!256 = !DIFile(filename: "seahorn/include/string_helper.h", directory: "/Users/jorge/Repos/verify-c-common")
!257 = !DISubroutineType(types: !258)
!258 = !{!127, !77, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!260 = !DISubprogram(name: "save_byte_from_array", scope: !261, file: !261, line: 77, type: !262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!261 = !DIFile(filename: "seahorn/include/utils.h", directory: "/Users/jorge/Repos/verify-c-common")
!262 = !DISubroutineType(types: !263)
!263 = !{null, !264, !77, !266}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "store_byte_from_buffer", file: !261, line: 42, size: 64, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !267, file: !261, line: 43, baseType: !73, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "byte", scope: !267, file: !261, line: 44, baseType: !104, size: 8, offset: 32)
!271 = !DISubprogram(name: "assert_byte_from_buffer_matches", scope: !261, file: !261, line: 68, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !264, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !278, nameTableKind: None)
!277 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/array_list_helper.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!278 = !{!249, !253, !279, !302, !304}
!279 = !DISubprogram(name: "sea_allocator", scope: !254, file: !254, line: 34, type: !280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!280 = !DISubroutineType(types: !281)
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_allocator", file: !63, line: 15, size: 160, elements: !284)
!284 = !{!285, !289, !293, !297, !301}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mem_acquire", scope: !283, file: !63, line: 16, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{!61, !282, !73}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "mem_release", scope: !283, file: !63, line: 17, baseType: !290, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !282, !61}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mem_realloc", scope: !283, file: !63, line: 19, baseType: !294, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{!61, !282, !61, !73, !73}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !283, file: !63, line: 21, baseType: !298, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DISubroutineType(types: !300)
!300 = !{!61, !282, !73, !73}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !283, file: !63, line: 22, baseType: !61, size: 32, offset: 128)
!302 = !DISubprogram(name: "sea_max_array_list_len", scope: !303, file: !303, line: 31, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!303 = !DIFile(filename: "seahorn/include/bounds.h", directory: "/Users/jorge/Repos/verify-c-common")
!304 = !DISubprogram(name: "sea_max_array_list_item_size", scope: !303, file: !303, line: 26, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !307, nameTableKind: None)
!306 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/byte_buf_helper.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!307 = !{!249, !308, !253, !309, !332, !333}
!308 = !DISubprogram(name: "sea_max_buffer_size", scope: !303, file: !303, line: 11, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!309 = !DISubprogram(name: "sea_allocator", scope: !254, file: !254, line: 34, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!310 = !DISubroutineType(types: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_allocator", file: !63, line: 15, size: 160, elements: !314)
!314 = !{!315, !319, !323, !327, !331}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "mem_acquire", scope: !313, file: !63, line: 16, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DISubroutineType(types: !318)
!318 = !{!61, !312, !73}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mem_release", scope: !313, file: !63, line: 17, baseType: !320, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !312, !61}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mem_realloc", scope: !313, file: !63, line: 19, baseType: !324, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DISubroutineType(types: !326)
!326 = !{!61, !312, !61, !73, !73}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !313, file: !63, line: 21, baseType: !328, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DISubroutineType(types: !330)
!330 = !{!61, !312, !73, !73}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !313, file: !63, line: 22, baseType: !61, size: 32, offset: 128)
!332 = !DISubprogram(name: "sea_malloc_aligned_havoc", scope: !207, file: !207, line: 57, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!333 = !DISubprogram(name: "bounded_malloc", scope: !254, file: !254, line: 22, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!334 = distinct !DICompileUnit(language: DW_LANG_C99, file: !335, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !336, nameTableKind: None)
!335 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/linked_list_helper.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!336 = !{!249, !337, !347, !61}
!337 = !DISubprogram(name: "aws_linked_list_attach_after", scope: !338, file: !338, line: 14, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!338 = !DIFile(filename: "seahorn/include/linked_list_helper.h", directory: "/Users/jorge/Repos/verify-c-common")
!339 = !DISubroutineType(types: !340)
!340 = !{null, !341, !341, !96}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_linked_list_node", file: !343, line: 13, size: 64, elements: !344)
!343 = !DIFile(filename: "aws-c-common/include/aws/common/linked_list.h", directory: "/Users/jorge/Repos/verify-c-common")
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !343, line: 14, baseType: !341, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !342, file: !343, line: 15, baseType: !341, size: 32, offset: 32)
!347 = !DISubprogram(name: "nd_linked_list_node", scope: !338, file: !338, line: 8, type: !348, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!348 = !DISubroutineType(types: !349)
!349 = !{!341}
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !352, nameTableKind: None)
!351 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/string_helper.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!352 = !{!210, !353, !378, !379, !103, !249, !380, !213, !332}
!353 = !DISubprogram(name: "sea_allocator", scope: !254, file: !254, line: 34, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!354 = !DISubroutineType(types: !355)
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_allocator", file: !63, line: 15, size: 160, elements: !358)
!358 = !{!359, !365, !369, !373, !377}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mem_acquire", scope: !357, file: !63, line: 16, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{!61, !356, !363}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !364, line: 46, baseType: !77)
!364 = !DIFile(filename: "src/clang-10.0.1.src/install-release/lib/clang/10.0.1/include/stddef.h", directory: "/Users/jorge")
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mem_release", scope: !357, file: !63, line: 17, baseType: !366, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !356, !61}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mem_realloc", scope: !357, file: !63, line: 19, baseType: !370, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DISubroutineType(types: !372)
!372 = !{!61, !356, !61, !363, !363}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !357, file: !63, line: 21, baseType: !374, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DISubroutineType(types: !376)
!376 = !{!61, !356, !363, !363}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !357, file: !63, line: 22, baseType: !61, size: 32, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!380 = !DISubprogram(name: "sea_max_string_len", scope: !303, file: !303, line: 16, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !383, nameTableKind: None)
!382 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/priority_queue_helper.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!383 = !{!384, !385, !417}
!384 = !DISubprogram(name: "nd_int", scope: !250, file: !250, line: 19, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!385 = !DISubprogram(name: "initialize_array_list", scope: !386, file: !386, line: 9, type: !387, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!386 = !DIFile(filename: "seahorn/include/array_list_helper.h", directory: "/Users/jorge/Repos/verify-c-common")
!387 = !DISubroutineType(types: !388)
!388 = !{null, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_array_list", file: !169, line: 15, size: 160, elements: !391)
!391 = !{!392, !413, !414, !415, !416}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !390, file: !169, line: 16, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_allocator", file: !63, line: 15, size: 160, elements: !395)
!395 = !{!396, !400, !404, !408, !412}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mem_acquire", scope: !394, file: !63, line: 16, baseType: !397, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DISubroutineType(types: !399)
!399 = !{!61, !393, !73}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mem_release", scope: !394, file: !63, line: 17, baseType: !401, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !393, !61}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mem_realloc", scope: !394, file: !63, line: 19, baseType: !405, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DISubroutineType(types: !407)
!407 = !{!61, !393, !61, !73, !73}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !394, file: !63, line: 21, baseType: !409, size: 32, offset: 96)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{!61, !393, !73, !73}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !394, file: !63, line: 22, baseType: !61, size: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "current_size", scope: !390, file: !169, line: 17, baseType: !73, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !390, file: !169, line: 18, baseType: !73, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !390, file: !169, line: 19, baseType: !73, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !169, line: 20, baseType: !61, size: 32, offset: 128)
!417 = !DISubprogram(name: "aws_array_list_is_bounded", scope: !386, file: !386, line: 19, type: !418, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!418 = !DISubroutineType(types: !419)
!419 = !{!96, !420, !77, !77}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !424, retainedTypes: !433, nameTableKind: None)
!423 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/ring_buffer_helper.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!424 = !{!425}
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "aws_memory_order", file: !426, line: 34, baseType: !7, size: 32, elements: !427)
!426 = !DIFile(filename: "aws-c-common/include/aws/common/atomics.h", directory: "/Users/jorge/Repos/verify-c-common")
!427 = !{!428, !429, !430, !431, !432}
!428 = !DIEnumerator(name: "aws_memory_order_relaxed", value: 0, isUnsigned: true)
!429 = !DIEnumerator(name: "aws_memory_order_acquire", value: 2, isUnsigned: true)
!430 = !DIEnumerator(name: "aws_memory_order_release", value: 3, isUnsigned: true)
!431 = !DIEnumerator(name: "aws_memory_order_acq_rel", value: 4, isUnsigned: true)
!432 = !DIEnumerator(name: "aws_memory_order_seq_cst", value: 5, isUnsigned: true)
!433 = !{!434, !333, !249, !457}
!434 = !DISubprogram(name: "sea_allocator", scope: !254, file: !254, line: 34, type: !435, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!435 = !DISubroutineType(types: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_allocator", file: !63, line: 15, size: 160, elements: !439)
!439 = !{!440, !444, !448, !452, !456}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mem_acquire", scope: !438, file: !63, line: 16, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DISubroutineType(types: !443)
!443 = !{!61, !437, !73}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mem_release", scope: !438, file: !63, line: 17, baseType: !445, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !437, !61}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mem_realloc", scope: !438, file: !63, line: 19, baseType: !449, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DISubroutineType(types: !451)
!451 = !{!61, !437, !61, !73, !73}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !438, file: !63, line: 21, baseType: !453, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DISubroutineType(types: !455)
!455 = !{!61, !437, !73, !73}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !438, file: !63, line: 22, baseType: !61, size: 32, offset: 128)
!457 = !DISubprogram(name: "nd_bool", scope: !250, file: !250, line: 18, type: !458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!458 = !DISubroutineType(types: !459)
!459 = !{!96}
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !462, retainedTypes: !469, nameTableKind: None)
!461 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/hash_table_helper.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!462 = !{!463}
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "aws_hash_iter_status", file: !464, line: 68, baseType: !7, size: 32, elements: !465)
!464 = !DIFile(filename: "aws-c-common/include/aws/common/hash_table.h", directory: "/Users/jorge/Repos/verify-c-common")
!465 = !{!466, !467, !468}
!466 = !DIEnumerator(name: "AWS_HASH_ITER_STATUS_DONE", value: 0, isUnsigned: true)
!467 = !DIEnumerator(name: "AWS_HASH_ITER_STATUS_DELETE_CALLED", value: 1, isUnsigned: true)
!468 = !DIEnumerator(name: "AWS_HASH_ITER_STATUS_READY_FOR_USE", value: 2, isUnsigned: true)
!469 = !{!249, !470, !333, !474, !497, !500, !503, !103, !559, !567, !457}
!470 = !DISubprogram(name: "hash_table_state_required_bytes", scope: !471, file: !471, line: 60, type: !472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!471 = !DIFile(filename: "aws-c-common/include/aws/common/private/hash_table_impl.h", directory: "/Users/jorge/Repos/verify-c-common")
!472 = !DISubroutineType(types: !473)
!473 = !{!134, !77, !259}
!474 = !DISubprogram(name: "sea_allocator", scope: !254, file: !254, line: 34, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!475 = !DISubroutineType(types: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_allocator", file: !63, line: 15, size: 160, elements: !479)
!479 = !{!480, !484, !488, !492, !496}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mem_acquire", scope: !478, file: !63, line: 16, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DISubroutineType(types: !483)
!483 = !{!61, !477, !73}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mem_release", scope: !478, file: !63, line: 17, baseType: !485, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !477, !61}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mem_realloc", scope: !478, file: !63, line: 19, baseType: !489, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!490 = !DISubroutineType(types: !491)
!491 = !{!61, !477, !61, !73, !73}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !478, file: !63, line: 21, baseType: !493, size: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DISubroutineType(types: !495)
!495 = !{!61, !477, !73, !73}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !478, file: !63, line: 22, baseType: !61, size: 32, offset: 128)
!497 = !DISubprogram(name: "nd_voidp", scope: !250, file: !250, line: 25, type: !498, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!498 = !DISubroutineType(types: !499)
!499 = !{!61}
!500 = !DISubprogram(name: "nd_hash_iter_status", scope: !501, file: !501, line: 40, type: !502, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!501 = !DIFile(filename: "seahorn/lib/hash_table_helper.c", directory: "/Users/jorge/Repos/verify-c-common")
!502 = !DISubroutineType(types: !462)
!503 = !DISubprogram(name: "aws_hash_iter_is_valid", scope: !464, file: !464, line: 424, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!504 = !DISubroutineType(types: !505)
!505 = !{!96, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_hash_iter", file: !464, line: 74, size: 288, elements: !509)
!509 = !{!510, !552, !553, !554, !555, !556, !557, !558}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !508, file: !464, line: 75, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_hash_table", file: !464, line: 48, size: 32, elements: !514)
!514 = !{!515}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "p_impl", scope: !513, file: !464, line: 49, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table_state", file: !471, line: 28, size: 352, elements: !518)
!518 = !{!519, !524, !529, !532, !533, !534, !535, !536, !537, !538, !540}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "hash_fn", scope: !517, file: !471, line: 29, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "aws_hash_fn", file: !464, line: 92, baseType: !522)
!522 = !DISubroutineType(types: !523)
!523 = !{!189, !121}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "equals_fn", scope: !517, file: !471, line: 30, baseType: !525, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "aws_hash_callback_eq_fn", file: !464, line: 104, baseType: !527)
!527 = !DISubroutineType(types: !528)
!528 = !{!96, !121, !121}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_key_fn", scope: !517, file: !471, line: 31, baseType: !530, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "aws_hash_callback_destroy_fn", file: !464, line: 116, baseType: !216)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_value_fn", scope: !517, file: !471, line: 32, baseType: !530, size: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !517, file: !471, line: 33, baseType: !477, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !517, file: !471, line: 35, baseType: !73, size: 32, offset: 160)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "entry_count", scope: !517, file: !471, line: 35, baseType: !73, size: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "max_load", scope: !517, file: !471, line: 36, baseType: !73, size: 32, offset: 224)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !517, file: !471, line: 38, baseType: !73, size: 32, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "max_load_factor", scope: !517, file: !471, line: 39, baseType: !539, size: 64, offset: 288)
!539 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !517, file: !471, line: 41, baseType: !541, offset: 352)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, elements: !550)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table_entry", file: !471, line: 13, size: 128, elements: !543)
!543 = !{!544, !549}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !542, file: !471, line: 14, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_hash_element", file: !464, line: 63, size: 64, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !545, file: !464, line: 64, baseType: !121, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !545, file: !464, line: 65, baseType: !61, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "hash_code", scope: !542, file: !471, line: 15, baseType: !189, size: 64, offset: 64)
!550 = !{!551}
!551 = !DISubrange(count: -1)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !508, file: !464, line: 76, baseType: !545, size: 64, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !508, file: !464, line: 77, baseType: !73, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !508, file: !464, line: 78, baseType: !73, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !508, file: !464, line: 79, baseType: !463, size: 32, offset: 160)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "unused_0", scope: !508, file: !464, line: 84, baseType: !134, size: 32, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "unused_1", scope: !508, file: !464, line: 85, baseType: !61, size: 32, offset: 224)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "unused_2", scope: !508, file: !464, line: 86, baseType: !61, size: 32, offset: 256)
!559 = !DISubprogram(name: "save_byte_from_array", scope: !261, file: !261, line: 77, type: !560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !264, !77, !562}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "store_byte_from_buffer", file: !261, line: 42, size: 64, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !563, file: !261, line: 43, baseType: !73, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "byte", scope: !563, file: !261, line: 44, baseType: !104, size: 8, offset: 32)
!567 = !DISubprogram(name: "assert_byte_from_buffer_matches", scope: !261, file: !261, line: 68, type: !568, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !264, !570}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !574, nameTableKind: None)
!573 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/utils.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!574 = !{!61, !249, !575, !103, !457, !578}
!575 = !DISubprogram(name: "nd_uint8_t", scope: !250, file: !250, line: 24, type: !576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!576 = !DISubroutineType(types: !577)
!577 = !{!106}
!578 = !DISubprogram(name: "nd_uint64_t", scope: !250, file: !250, line: 23, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!579 = !DISubroutineType(types: !580)
!580 = !{!191}
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !583, retainedTypes: !594, nameTableKind: None)
!582 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/sea_allocators.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!583 = !{!584}
!584 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !586, file: !585, line: 25, baseType: !7, size: 32, elements: !592)
!585 = !DIFile(filename: "seahorn/lib/sea_allocators.c", directory: "/Users/jorge/Repos/verify-c-common")
!586 = distinct !DISubprogram(name: "sea_malloc_aligned", scope: !585, file: !585, line: 24, type: !587, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !581, retainedNodes: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!61, !363}
!589 = !{!590, !591}
!590 = !DILocalVariable(name: "sz", arg: 1, scope: !586, file: !585, line: 24, type: !363)
!591 = !DILocalVariable(name: "alloc_sz", scope: !586, file: !585, line: 26, type: !363)
!592 = !{!593}
!593 = !DIEnumerator(name: "S_ALIGNMENT", value: 8, isUnsigned: true)
!594 = !{!595, !61, !596, !214}
!595 = !DISubprogram(name: "nd_malloc_is_fail", scope: !585, file: !585, line: 9, type: !458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!596 = !DISubprogram(name: "memhavoc", scope: !585, file: !585, line: 7, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !599, nameTableKind: None)
!598 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/allocator_override.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!599 = !{!253, !61, !214, !103, !600, !159, !162}
!600 = !DISubprogram(name: "sea_allocator", scope: !254, file: !254, line: 34, type: !601, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!601 = !DISubroutineType(types: !602)
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aws_allocator", file: !63, line: 15, size: 160, elements: !605)
!605 = !{!606, !610, !614, !618, !622}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "mem_acquire", scope: !604, file: !63, line: 16, baseType: !607, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{!61, !603, !73}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mem_release", scope: !604, file: !63, line: 17, baseType: !611, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !603, !61}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mem_realloc", scope: !604, file: !63, line: 19, baseType: !615, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DISubroutineType(types: !617)
!617 = !{!61, !603, !61, !73, !73}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !604, file: !63, line: 21, baseType: !619, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DISubroutineType(types: !621)
!621 = !{!61, !603, !73, !73}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !604, file: !63, line: 22, baseType: !61, size: 32, offset: 128)
!623 = distinct !DICompileUnit(language: DW_LANG_C99, file: !624, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !625, nameTableKind: None)
!624 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/bcmp.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!625 = !{!308, !61}
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, nameTableKind: None)
!627 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/bounds.c", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!628 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !629, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !630, imports: !636, nameTableKind: None)
!629 = !DIFile(filename: "/Users/jorge/Repos/verify-c-common/seahorn/lib/sea_string.cc", directory: "/Users/jorge/Repos/verify-c-common/build/seahorn/lib")
!630 = !{!380, !631, !635}
!631 = !DISubprogram(name: "sea_strlen", scope: !632, file: !632, line: 8, type: !633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!632 = !DIFile(filename: "seahorn/include/sea_string.h", directory: "/Users/jorge/Repos/verify-c-common")
!633 = !DISubroutineType(types: !634)
!634 = !{!77, !127, !77}
!635 = !DISubprogram(name: "nd_size_t", linkageName: "_Z9nd_size_tv", scope: !250, file: !250, line: 20, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!636 = !{!637}
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !628, entity: !638, file: !642, line: 51)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !640, file: !639, line: 56, baseType: !641)
!639 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.0.sdk/usr/include/c++/v1/__nullptr", directory: "")
!640 = !DINamespace(name: "std", scope: null)
!641 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!642 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.0.sdk/usr/include/c++/v1/stddef.h", directory: "")
!643 = !{!"clang version 10.0.1 "}
!644 = !{i32 2, !"SDK Version", [2 x i32] [i32 12, i32 0]}
!645 = !{i32 7, !"Dwarf Version", i32 4}
!646 = !{i32 2, !"Debug Info Version", i32 3}
!647 = !{i32 1, !"wchar_size", i32 4}
!648 = !{i32 1, !"min_enum_size", i32 4}
!649 = !{i32 7, !"PIC Level", i32 2}
!650 = distinct !DISubprogram(name: "aws_byte_buf_init", scope: !195, file: !195, line: 17, type: !651, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !653)
!651 = !DISubroutineType(types: !652)
!652 = !{!134, !112, !66, !73}
!653 = !{!654, !655, !656}
!654 = !DILocalVariable(name: "buf", arg: 1, scope: !650, file: !195, line: 17, type: !112)
!655 = !DILocalVariable(name: "allocator", arg: 2, scope: !650, file: !195, line: 17, type: !66)
!656 = !DILocalVariable(name: "capacity", arg: 3, scope: !650, file: !195, line: 17, type: !73)
!657 = !{!658, !658, i64 0}
!658 = !{!"any pointer", !659, i64 0}
!659 = !{!"omnipotent char", !660, i64 0}
!660 = !{!"Simple C/C++ TBAA"}
!661 = !DILocation(line: 17, column: 44, scope: !650)
!662 = !DILocation(line: 17, column: 71, scope: !650)
!663 = !{!664, !664, i64 0}
!664 = !{!"long", !659, i64 0}
!665 = !DILocation(line: 17, column: 89, scope: !650)
!666 = !DILocation(line: 21, column: 20, scope: !650)
!667 = !DILocation(line: 21, column: 29, scope: !650)
!668 = !DILocation(line: 21, column: 19, scope: !650)
!669 = !DILocation(line: 21, column: 60, scope: !650)
!670 = !DILocation(line: 21, column: 71, scope: !650)
!671 = !DILocation(line: 21, column: 44, scope: !650)
!672 = !DILocation(line: 21, column: 5, scope: !650)
!673 = !DILocation(line: 21, column: 10, scope: !650)
!674 = !DILocation(line: 21, column: 17, scope: !650)
!675 = !{!676, !658, i64 4}
!676 = !{!"aws_byte_buf", !664, i64 0, !658, i64 4, !664, i64 8, !658, i64 12}
!677 = !DILocation(line: 22, column: 9, scope: !678)
!678 = distinct !DILexicalBlock(scope: !650, file: !195, line: 22, column: 9)
!679 = !DILocation(line: 22, column: 18, scope: !678)
!680 = !DILocation(line: 22, column: 23, scope: !678)
!681 = !DILocation(line: 22, column: 26, scope: !678)
!682 = !DILocation(line: 22, column: 31, scope: !678)
!683 = !DILocation(line: 22, column: 38, scope: !678)
!684 = !DILocation(line: 22, column: 9, scope: !650)
!685 = !DILocation(line: 23, column: 9, scope: !686)
!686 = distinct !DILexicalBlock(scope: !678, file: !195, line: 22, column: 47)
!687 = !DILocation(line: 23, column: 9, scope: !688)
!688 = distinct !DILexicalBlock(scope: !686, file: !195, line: 23, column: 9)
!689 = !DILocation(line: 24, column: 9, scope: !686)
!690 = !DILocation(line: 27, column: 5, scope: !650)
!691 = !DILocation(line: 27, column: 10, scope: !650)
!692 = !DILocation(line: 27, column: 14, scope: !650)
!693 = !{!676, !664, i64 0}
!694 = !DILocation(line: 28, column: 21, scope: !650)
!695 = !DILocation(line: 28, column: 5, scope: !650)
!696 = !DILocation(line: 28, column: 10, scope: !650)
!697 = !DILocation(line: 28, column: 19, scope: !650)
!698 = !{!676, !664, i64 8}
!699 = !DILocation(line: 29, column: 22, scope: !650)
!700 = !DILocation(line: 29, column: 5, scope: !650)
!701 = !DILocation(line: 29, column: 10, scope: !650)
!702 = !DILocation(line: 29, column: 20, scope: !650)
!703 = !{!676, !658, i64 12}
!704 = !DILocation(line: 31, column: 5, scope: !650)
!705 = !DILocation(line: 32, column: 1, scope: !650)
!706 = distinct !DISubprogram(name: "aws_byte_buf_init_copy", scope: !195, file: !195, line: 34, type: !707, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !709)
!707 = !DISubroutineType(types: !708)
!708 = !{!134, !112, !66, !97}
!709 = !{!710, !711, !712}
!710 = !DILocalVariable(name: "dest", arg: 1, scope: !706, file: !195, line: 34, type: !112)
!711 = !DILocalVariable(name: "allocator", arg: 2, scope: !706, file: !195, line: 34, type: !66)
!712 = !DILocalVariable(name: "src", arg: 3, scope: !706, file: !195, line: 34, type: !97)
!713 = !DILocation(line: 34, column: 49, scope: !706)
!714 = !DILocation(line: 34, column: 77, scope: !706)
!715 = !DILocation(line: 34, column: 115, scope: !706)
!716 = !DILocation(line: 37, column: 5, scope: !706)
!717 = !DILocation(line: 37, column: 5, scope: !718)
!718 = distinct !DILexicalBlock(scope: !719, file: !195, line: 37, column: 5)
!719 = distinct !DILexicalBlock(scope: !706, file: !195, line: 37, column: 5)
!720 = !DILocation(line: 37, column: 5, scope: !719)
!721 = !DILocation(line: 37, column: 5, scope: !722)
!722 = distinct !DILexicalBlock(scope: !718, file: !195, line: 37, column: 5)
!723 = !DILocation(line: 39, column: 10, scope: !724)
!724 = distinct !DILexicalBlock(scope: !706, file: !195, line: 39, column: 9)
!725 = !DILocation(line: 39, column: 15, scope: !724)
!726 = !DILocation(line: 39, column: 9, scope: !706)
!727 = !DILocation(line: 40, column: 9, scope: !728)
!728 = distinct !DILexicalBlock(scope: !724, file: !195, line: 39, column: 23)
!729 = !DILocation(line: 40, column: 9, scope: !730)
!730 = distinct !DILexicalBlock(scope: !728, file: !195, line: 40, column: 9)
!731 = !DILocation(line: 41, column: 27, scope: !728)
!732 = !DILocation(line: 41, column: 9, scope: !728)
!733 = !DILocation(line: 41, column: 15, scope: !728)
!734 = !DILocation(line: 41, column: 25, scope: !728)
!735 = !DILocation(line: 43, column: 9, scope: !728)
!736 = !DILocation(line: 46, column: 6, scope: !706)
!737 = !DILocation(line: 46, column: 14, scope: !706)
!738 = !DILocation(line: 46, column: 13, scope: !706)
!739 = !{i64 0, i64 4, !663, i64 4, i64 4, !657, i64 8, i64 4, !663, i64 12, i64 4, !657}
!740 = !DILocation(line: 47, column: 23, scope: !706)
!741 = !DILocation(line: 47, column: 5, scope: !706)
!742 = !DILocation(line: 47, column: 11, scope: !706)
!743 = !DILocation(line: 47, column: 21, scope: !706)
!744 = !DILocation(line: 48, column: 47, scope: !706)
!745 = !DILocation(line: 48, column: 58, scope: !706)
!746 = !DILocation(line: 48, column: 63, scope: !706)
!747 = !DILocation(line: 48, column: 31, scope: !706)
!748 = !DILocation(line: 48, column: 5, scope: !706)
!749 = !DILocation(line: 48, column: 11, scope: !706)
!750 = !DILocation(line: 48, column: 18, scope: !706)
!751 = !DILocation(line: 49, column: 9, scope: !752)
!752 = distinct !DILexicalBlock(scope: !706, file: !195, line: 49, column: 9)
!753 = !DILocation(line: 49, column: 15, scope: !752)
!754 = !DILocation(line: 49, column: 22, scope: !752)
!755 = !DILocation(line: 49, column: 9, scope: !706)
!756 = !DILocation(line: 50, column: 9, scope: !757)
!757 = distinct !DILexicalBlock(scope: !752, file: !195, line: 49, column: 31)
!758 = !DILocation(line: 50, column: 9, scope: !759)
!759 = distinct !DILexicalBlock(scope: !757, file: !195, line: 50, column: 9)
!760 = !DILocation(line: 51, column: 9, scope: !757)
!761 = !DILocation(line: 53, column: 5, scope: !706)
!762 = !DILocation(line: 55, column: 5, scope: !706)
!763 = !DILocation(line: 56, column: 1, scope: !706)
!764 = distinct !DISubprogram(name: "aws_byte_buf_is_valid", scope: !195, file: !195, line: 58, type: !765, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !768)
!765 = !DISubroutineType(types: !766)
!766 = !{!96, !767}
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!768 = !{!769}
!769 = !DILocalVariable(name: "buf", arg: 1, scope: !764, file: !195, line: 58, type: !767)
!770 = !DILocation(line: 58, column: 61, scope: !764)
!771 = !DILocation(line: 59, column: 12, scope: !764)
!772 = !DILocation(line: 59, column: 16, scope: !764)
!773 = !DILocation(line: 59, column: 24, scope: !764)
!774 = !DILocation(line: 60, column: 14, scope: !764)
!775 = !DILocation(line: 60, column: 19, scope: !764)
!776 = !DILocation(line: 60, column: 28, scope: !764)
!777 = !DILocation(line: 60, column: 33, scope: !764)
!778 = !DILocation(line: 60, column: 36, scope: !764)
!779 = !DILocation(line: 60, column: 41, scope: !764)
!780 = !DILocation(line: 60, column: 45, scope: !764)
!781 = !DILocation(line: 60, column: 50, scope: !764)
!782 = !DILocation(line: 60, column: 53, scope: !764)
!783 = !DILocation(line: 60, column: 58, scope: !764)
!784 = !DILocation(line: 60, column: 65, scope: !764)
!785 = !DILocation(line: 60, column: 74, scope: !764)
!786 = !DILocation(line: 61, column: 14, scope: !764)
!787 = !DILocation(line: 61, column: 19, scope: !764)
!788 = !DILocation(line: 61, column: 28, scope: !764)
!789 = !DILocation(line: 61, column: 32, scope: !764)
!790 = !DILocation(line: 61, column: 35, scope: !764)
!791 = !DILocation(line: 61, column: 40, scope: !764)
!792 = !DILocation(line: 61, column: 47, scope: !764)
!793 = !DILocation(line: 61, column: 52, scope: !764)
!794 = !DILocation(line: 61, column: 44, scope: !764)
!795 = !DILocation(line: 61, column: 61, scope: !764)
!796 = !DILocation(line: 61, column: 64, scope: !764)
!797 = !DILocation(line: 0, scope: !764)
!798 = !DILocation(line: 59, column: 5, scope: !764)
!799 = distinct !DISubprogram(name: "aws_raise_error", scope: !800, file: !800, line: 17, type: !801, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !803)
!800 = !DIFile(filename: "aws-c-common/include/aws/common/error.inl", directory: "/Users/jorge/Repos/verify-c-common")
!801 = !DISubroutineType(types: !802)
!802 = !{!134, !134}
!803 = !{!804}
!804 = !DILocalVariable(name: "err", arg: 1, scope: !799, file: !800, line: 17, type: !134)
!805 = !{!806, !806, i64 0}
!806 = !{!"int", !659, i64 0}
!807 = !DILocation(line: 17, column: 25, scope: !799)
!808 = !DILocation(line: 24, column: 29, scope: !799)
!809 = !DILocation(line: 24, column: 5, scope: !799)
!810 = !DILocation(line: 26, column: 5, scope: !799)
!811 = distinct !DISubprogram(name: "aws_byte_cursor_is_valid", scope: !195, file: !195, line: 64, type: !812, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{!96, !149}
!814 = !{!815}
!815 = !DILocalVariable(name: "cursor", arg: 1, scope: !811, file: !195, line: 64, type: !149)
!816 = !DILocation(line: 64, column: 61, scope: !811)
!817 = !DILocation(line: 65, column: 12, scope: !811)
!818 = !DILocation(line: 65, column: 19, scope: !811)
!819 = !DILocation(line: 65, column: 27, scope: !811)
!820 = !DILocation(line: 66, column: 14, scope: !811)
!821 = !DILocation(line: 66, column: 22, scope: !811)
!822 = !{!823, !664, i64 0}
!823 = !{!"aws_byte_cursor", !664, i64 0, !658, i64 4}
!824 = !DILocation(line: 66, column: 26, scope: !811)
!825 = !DILocation(line: 66, column: 32, scope: !811)
!826 = !DILocation(line: 66, column: 36, scope: !811)
!827 = !DILocation(line: 66, column: 44, scope: !811)
!828 = !DILocation(line: 66, column: 48, scope: !811)
!829 = !DILocation(line: 66, column: 52, scope: !811)
!830 = !DILocation(line: 66, column: 55, scope: !811)
!831 = !DILocation(line: 66, column: 63, scope: !811)
!832 = !{!823, !658, i64 4}
!833 = !DILocation(line: 66, column: 67, scope: !811)
!834 = !DILocation(line: 66, column: 70, scope: !811)
!835 = !DILocation(line: 0, scope: !811)
!836 = !DILocation(line: 65, column: 5, scope: !811)
!837 = distinct !DISubprogram(name: "aws_byte_buf_reset", scope: !195, file: !195, line: 69, type: !838, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !840)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !112, !96}
!840 = !{!841, !842}
!841 = !DILocalVariable(name: "buf", arg: 1, scope: !837, file: !195, line: 69, type: !112)
!842 = !DILocalVariable(name: "zero_contents", arg: 2, scope: !837, file: !195, line: 69, type: !96)
!843 = !DILocation(line: 69, column: 46, scope: !837)
!844 = !{!845, !845, i64 0}
!845 = !{!"_Bool", !659, i64 0}
!846 = !DILocation(line: 69, column: 56, scope: !837)
!847 = !DILocation(line: 70, column: 9, scope: !848)
!848 = distinct !DILexicalBlock(scope: !837, file: !195, line: 70, column: 9)
!849 = !{i8 0, i8 2}
!850 = !DILocation(line: 70, column: 9, scope: !837)
!851 = !DILocation(line: 71, column: 34, scope: !852)
!852 = distinct !DILexicalBlock(scope: !848, file: !195, line: 70, column: 24)
!853 = !DILocation(line: 71, column: 9, scope: !852)
!854 = !DILocation(line: 72, column: 5, scope: !852)
!855 = !DILocation(line: 73, column: 5, scope: !837)
!856 = !DILocation(line: 73, column: 10, scope: !837)
!857 = !DILocation(line: 73, column: 14, scope: !837)
!858 = !DILocation(line: 74, column: 1, scope: !837)
!859 = distinct !DISubprogram(name: "aws_byte_buf_secure_zero", scope: !195, file: !195, line: 87, type: !110, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !860)
!860 = !{!861}
!861 = !DILocalVariable(name: "buf", arg: 1, scope: !859, file: !195, line: 87, type: !112)
!862 = !DILocation(line: 87, column: 52, scope: !859)
!863 = !DILocation(line: 89, column: 9, scope: !864)
!864 = distinct !DILexicalBlock(scope: !859, file: !195, line: 89, column: 9)
!865 = !DILocation(line: 89, column: 14, scope: !864)
!866 = !DILocation(line: 89, column: 9, scope: !859)
!867 = !DILocation(line: 90, column: 25, scope: !868)
!868 = distinct !DILexicalBlock(scope: !864, file: !195, line: 89, column: 22)
!869 = !DILocation(line: 90, column: 30, scope: !868)
!870 = !DILocation(line: 90, column: 38, scope: !868)
!871 = !DILocation(line: 90, column: 43, scope: !868)
!872 = !DILocation(line: 90, column: 9, scope: !868)
!873 = !DILocation(line: 91, column: 5, scope: !868)
!874 = !DILocation(line: 92, column: 5, scope: !859)
!875 = !DILocation(line: 92, column: 10, scope: !859)
!876 = !DILocation(line: 92, column: 14, scope: !859)
!877 = !DILocation(line: 94, column: 1, scope: !859)
!878 = distinct !DISubprogram(name: "aws_byte_buf_clean_up", scope: !195, file: !195, line: 76, type: !110, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !879)
!879 = !{!880}
!880 = !DILocalVariable(name: "buf", arg: 1, scope: !878, file: !195, line: 76, type: !112)
!881 = !DILocation(line: 76, column: 49, scope: !878)
!882 = !DILocation(line: 78, column: 9, scope: !883)
!883 = distinct !DILexicalBlock(scope: !878, file: !195, line: 78, column: 9)
!884 = !DILocation(line: 78, column: 14, scope: !883)
!885 = !DILocation(line: 78, column: 24, scope: !883)
!886 = !DILocation(line: 78, column: 27, scope: !883)
!887 = !DILocation(line: 78, column: 32, scope: !883)
!888 = !DILocation(line: 78, column: 9, scope: !878)
!889 = !DILocation(line: 79, column: 25, scope: !890)
!890 = distinct !DILexicalBlock(scope: !883, file: !195, line: 78, column: 40)
!891 = !DILocation(line: 79, column: 30, scope: !890)
!892 = !DILocation(line: 79, column: 49, scope: !890)
!893 = !DILocation(line: 79, column: 54, scope: !890)
!894 = !DILocation(line: 79, column: 9, scope: !890)
!895 = !DILocation(line: 80, column: 5, scope: !890)
!896 = !DILocation(line: 81, column: 5, scope: !878)
!897 = !DILocation(line: 81, column: 10, scope: !878)
!898 = !DILocation(line: 81, column: 20, scope: !878)
!899 = !DILocation(line: 82, column: 5, scope: !878)
!900 = !DILocation(line: 82, column: 10, scope: !878)
!901 = !DILocation(line: 82, column: 17, scope: !878)
!902 = !DILocation(line: 83, column: 5, scope: !878)
!903 = !DILocation(line: 83, column: 10, scope: !878)
!904 = !DILocation(line: 83, column: 14, scope: !878)
!905 = !DILocation(line: 84, column: 5, scope: !878)
!906 = !DILocation(line: 84, column: 10, scope: !878)
!907 = !DILocation(line: 84, column: 19, scope: !878)
!908 = !DILocation(line: 85, column: 1, scope: !878)
!909 = distinct !DISubprogram(name: "aws_byte_buf_clean_up_secure", scope: !195, file: !195, line: 96, type: !110, scopeLine: 96, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !910)
!910 = !{!911}
!911 = !DILocalVariable(name: "buf", arg: 1, scope: !909, file: !195, line: 96, type: !112)
!912 = !DILocation(line: 96, column: 56, scope: !909)
!913 = !DILocation(line: 98, column: 30, scope: !909)
!914 = !DILocation(line: 98, column: 5, scope: !909)
!915 = !DILocation(line: 99, column: 27, scope: !909)
!916 = !DILocation(line: 99, column: 5, scope: !909)
!917 = !DILocation(line: 101, column: 1, scope: !909)
!918 = distinct !DISubprogram(name: "aws_byte_buf_eq", scope: !195, file: !195, line: 103, type: !919, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !921)
!919 = !DISubroutineType(types: !920)
!920 = !{!96, !767, !767}
!921 = !{!922, !923, !924}
!922 = !DILocalVariable(name: "a", arg: 1, scope: !918, file: !195, line: 103, type: !767)
!923 = !DILocalVariable(name: "b", arg: 2, scope: !918, file: !195, line: 103, type: !767)
!924 = !DILocalVariable(name: "rval", scope: !918, file: !195, line: 106, type: !96)
!925 = !DILocation(line: 103, column: 55, scope: !918)
!926 = !DILocation(line: 103, column: 91, scope: !918)
!927 = !DILocation(line: 106, column: 5, scope: !918)
!928 = !DILocation(line: 106, column: 10, scope: !918)
!929 = !DILocation(line: 106, column: 30, scope: !918)
!930 = !DILocation(line: 106, column: 33, scope: !918)
!931 = !DILocation(line: 106, column: 41, scope: !918)
!932 = !DILocation(line: 106, column: 44, scope: !918)
!933 = !DILocation(line: 106, column: 49, scope: !918)
!934 = !DILocation(line: 106, column: 52, scope: !918)
!935 = !DILocation(line: 106, column: 60, scope: !918)
!936 = !DILocation(line: 106, column: 63, scope: !918)
!937 = !DILocation(line: 106, column: 17, scope: !918)
!938 = !DILocation(line: 109, column: 12, scope: !918)
!939 = !DILocation(line: 110, column: 1, scope: !918)
!940 = !DILocation(line: 109, column: 5, scope: !918)
!941 = distinct !DISubprogram(name: "aws_array_eq", scope: !195, file: !195, line: 419, type: !942, scopeLine: 419, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !946)
!942 = !DISubroutineType(types: !943)
!943 = !{!96, !944, !945, !944, !945}
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!946 = !{!947, !948, !949, !950}
!947 = !DILocalVariable(name: "array_a", arg: 1, scope: !941, file: !195, line: 419, type: !944)
!948 = !DILocalVariable(name: "len_a", arg: 2, scope: !941, file: !195, line: 419, type: !945)
!949 = !DILocalVariable(name: "array_b", arg: 3, scope: !941, file: !195, line: 419, type: !944)
!950 = !DILocalVariable(name: "len_b", arg: 4, scope: !941, file: !195, line: 419, type: !945)
!951 = !DILocation(line: 419, column: 37, scope: !941)
!952 = !DILocation(line: 419, column: 59, scope: !941)
!953 = !DILocation(line: 419, column: 84, scope: !941)
!954 = !DILocation(line: 419, column: 106, scope: !941)
!955 = !DILocation(line: 425, column: 9, scope: !956)
!956 = distinct !DILexicalBlock(scope: !941, file: !195, line: 425, column: 9)
!957 = !DILocation(line: 425, column: 18, scope: !956)
!958 = !DILocation(line: 425, column: 15, scope: !956)
!959 = !DILocation(line: 425, column: 9, scope: !941)
!960 = !DILocation(line: 426, column: 9, scope: !961)
!961 = distinct !DILexicalBlock(scope: !956, file: !195, line: 425, column: 25)
!962 = !DILocation(line: 429, column: 9, scope: !963)
!963 = distinct !DILexicalBlock(scope: !941, file: !195, line: 429, column: 9)
!964 = !DILocation(line: 429, column: 15, scope: !963)
!965 = !DILocation(line: 429, column: 9, scope: !941)
!966 = !DILocation(line: 430, column: 9, scope: !967)
!967 = distinct !DILexicalBlock(scope: !963, file: !195, line: 429, column: 21)
!968 = !DILocation(line: 433, column: 20, scope: !941)
!969 = !DILocation(line: 433, column: 29, scope: !941)
!970 = !DILocation(line: 433, column: 38, scope: !941)
!971 = !DILocation(line: 433, column: 13, scope: !941)
!972 = !DILocation(line: 433, column: 12, scope: !941)
!973 = !DILocation(line: 433, column: 5, scope: !941)
!974 = !DILocation(line: 434, column: 1, scope: !941)
!975 = distinct !DISubprogram(name: "aws_byte_buf_eq_ignore_case", scope: !195, file: !195, line: 112, type: !919, scopeLine: 112, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !976)
!976 = !{!977, !978, !979}
!977 = !DILocalVariable(name: "a", arg: 1, scope: !975, file: !195, line: 112, type: !767)
!978 = !DILocalVariable(name: "b", arg: 2, scope: !975, file: !195, line: 112, type: !767)
!979 = !DILocalVariable(name: "rval", scope: !975, file: !195, line: 115, type: !96)
!980 = !DILocation(line: 112, column: 67, scope: !975)
!981 = !DILocation(line: 112, column: 103, scope: !975)
!982 = !DILocation(line: 115, column: 5, scope: !975)
!983 = !DILocation(line: 115, column: 10, scope: !975)
!984 = !DILocation(line: 115, column: 42, scope: !975)
!985 = !DILocation(line: 115, column: 45, scope: !975)
!986 = !DILocation(line: 115, column: 53, scope: !975)
!987 = !DILocation(line: 115, column: 56, scope: !975)
!988 = !DILocation(line: 115, column: 61, scope: !975)
!989 = !DILocation(line: 115, column: 64, scope: !975)
!990 = !DILocation(line: 115, column: 72, scope: !975)
!991 = !DILocation(line: 115, column: 75, scope: !975)
!992 = !DILocation(line: 115, column: 17, scope: !975)
!993 = !DILocation(line: 118, column: 12, scope: !975)
!994 = !DILocation(line: 119, column: 1, scope: !975)
!995 = !DILocation(line: 118, column: 5, scope: !975)
!996 = distinct !DISubprogram(name: "aws_array_eq_ignore_case", scope: !195, file: !195, line: 394, type: !942, scopeLine: 398, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004}
!998 = !DILocalVariable(name: "array_a", arg: 1, scope: !996, file: !195, line: 395, type: !944)
!999 = !DILocalVariable(name: "len_a", arg: 2, scope: !996, file: !195, line: 396, type: !945)
!1000 = !DILocalVariable(name: "array_b", arg: 3, scope: !996, file: !195, line: 397, type: !944)
!1001 = !DILocalVariable(name: "len_b", arg: 4, scope: !996, file: !195, line: 398, type: !945)
!1002 = !DILocalVariable(name: "bytes_a", scope: !996, file: !195, line: 408, type: !151)
!1003 = !DILocalVariable(name: "bytes_b", scope: !996, file: !195, line: 409, type: !151)
!1004 = !DILocalVariable(name: "i", scope: !1005, file: !195, line: 410, type: !73)
!1005 = distinct !DILexicalBlock(scope: !996, file: !195, line: 410, column: 5)
!1006 = !DILocation(line: 395, column: 23, scope: !996)
!1007 = !DILocation(line: 396, column: 18, scope: !996)
!1008 = !DILocation(line: 397, column: 23, scope: !996)
!1009 = !DILocation(line: 398, column: 18, scope: !996)
!1010 = !DILocation(line: 404, column: 9, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !996, file: !195, line: 404, column: 9)
!1012 = !DILocation(line: 404, column: 18, scope: !1011)
!1013 = !DILocation(line: 404, column: 15, scope: !1011)
!1014 = !DILocation(line: 404, column: 9, scope: !996)
!1015 = !DILocation(line: 405, column: 9, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1011, file: !195, line: 404, column: 25)
!1017 = !DILocation(line: 408, column: 5, scope: !996)
!1018 = !DILocation(line: 408, column: 20, scope: !996)
!1019 = !DILocation(line: 408, column: 30, scope: !996)
!1020 = !DILocation(line: 409, column: 5, scope: !996)
!1021 = !DILocation(line: 409, column: 20, scope: !996)
!1022 = !DILocation(line: 409, column: 30, scope: !996)
!1023 = !DILocation(line: 410, column: 10, scope: !1005)
!1024 = !DILocation(line: 410, column: 17, scope: !1005)
!1025 = !DILocation(line: 410, column: 24, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1005, file: !195, line: 410, column: 5)
!1027 = !DILocation(line: 410, column: 28, scope: !1026)
!1028 = !DILocation(line: 410, column: 26, scope: !1026)
!1029 = !DILocation(line: 410, column: 5, scope: !1005)
!1030 = !DILocation(line: 411, column: 29, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !195, line: 411, column: 13)
!1032 = distinct !DILexicalBlock(scope: !1026, file: !195, line: 410, column: 40)
!1033 = !DILocation(line: 411, column: 37, scope: !1031)
!1034 = !{!659, !659, i64 0}
!1035 = !DILocation(line: 411, column: 13, scope: !1031)
!1036 = !DILocation(line: 411, column: 60, scope: !1031)
!1037 = !DILocation(line: 411, column: 68, scope: !1031)
!1038 = !DILocation(line: 411, column: 44, scope: !1031)
!1039 = !DILocation(line: 411, column: 41, scope: !1031)
!1040 = !DILocation(line: 411, column: 13, scope: !1032)
!1041 = !DILocation(line: 412, column: 13, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1031, file: !195, line: 411, column: 73)
!1043 = !DILocation(line: 414, column: 5, scope: !1032)
!1044 = !DILocation(line: 410, column: 35, scope: !1026)
!1045 = !DILocation(line: 410, column: 5, scope: !1026)
!1046 = distinct !{!1046, !1029, !1047}
!1047 = !DILocation(line: 414, column: 5, scope: !1005)
!1048 = !DILocation(line: 416, column: 5, scope: !996)
!1049 = !DILocation(line: 417, column: 1, scope: !996)
!1050 = distinct !DISubprogram(name: "aws_byte_buf_eq_c_str", scope: !195, file: !195, line: 121, type: !1051, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1054)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!96, !767, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!1054 = !{!1055, !1056, !1057}
!1055 = !DILocalVariable(name: "buf", arg: 1, scope: !1050, file: !195, line: 121, type: !767)
!1056 = !DILocalVariable(name: "c_str", arg: 2, scope: !1050, file: !195, line: 121, type: !1053)
!1057 = !DILocalVariable(name: "rval", scope: !1050, file: !195, line: 124, type: !96)
!1058 = !DILocation(line: 121, column: 61, scope: !1050)
!1059 = !DILocation(line: 121, column: 84, scope: !1050)
!1060 = !DILocation(line: 124, column: 5, scope: !1050)
!1061 = !DILocation(line: 124, column: 10, scope: !1050)
!1062 = !DILocation(line: 124, column: 36, scope: !1050)
!1063 = !DILocation(line: 124, column: 41, scope: !1050)
!1064 = !DILocation(line: 124, column: 49, scope: !1050)
!1065 = !DILocation(line: 124, column: 54, scope: !1050)
!1066 = !DILocation(line: 124, column: 59, scope: !1050)
!1067 = !DILocation(line: 124, column: 17, scope: !1050)
!1068 = !DILocation(line: 126, column: 12, scope: !1050)
!1069 = !DILocation(line: 127, column: 1, scope: !1050)
!1070 = !DILocation(line: 126, column: 5, scope: !1050)
!1071 = distinct !DISubprogram(name: "aws_array_eq_c_str", scope: !195, file: !195, line: 464, type: !1072, scopeLine: 464, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1074)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!96, !944, !945, !1053}
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1082}
!1075 = !DILocalVariable(name: "array", arg: 1, scope: !1071, file: !195, line: 464, type: !944)
!1076 = !DILocalVariable(name: "array_len", arg: 2, scope: !1071, file: !195, line: 464, type: !945)
!1077 = !DILocalVariable(name: "c_str", arg: 3, scope: !1071, file: !195, line: 464, type: !1053)
!1078 = !DILocalVariable(name: "array_bytes", scope: !1071, file: !195, line: 475, type: !151)
!1079 = !DILocalVariable(name: "str_bytes", scope: !1071, file: !195, line: 476, type: !151)
!1080 = !DILocalVariable(name: "i", scope: !1081, file: !195, line: 478, type: !73)
!1081 = distinct !DILexicalBlock(scope: !1071, file: !195, line: 478, column: 5)
!1082 = !DILocalVariable(name: "s", scope: !1083, file: !195, line: 479, type: !104)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !195, line: 478, column: 44)
!1084 = distinct !DILexicalBlock(scope: !1081, file: !195, line: 478, column: 5)
!1085 = !DILocation(line: 464, column: 43, scope: !1071)
!1086 = !DILocation(line: 464, column: 63, scope: !1071)
!1087 = !DILocation(line: 464, column: 92, scope: !1071)
!1088 = !DILocation(line: 475, column: 5, scope: !1071)
!1089 = !DILocation(line: 475, column: 20, scope: !1071)
!1090 = !DILocation(line: 475, column: 34, scope: !1071)
!1091 = !DILocation(line: 476, column: 5, scope: !1071)
!1092 = !DILocation(line: 476, column: 20, scope: !1071)
!1093 = !DILocation(line: 476, column: 49, scope: !1071)
!1094 = !DILocation(line: 478, column: 10, scope: !1081)
!1095 = !DILocation(line: 478, column: 17, scope: !1081)
!1096 = !DILocation(line: 478, column: 24, scope: !1084)
!1097 = !DILocation(line: 478, column: 28, scope: !1084)
!1098 = !DILocation(line: 478, column: 26, scope: !1084)
!1099 = !DILocation(line: 478, column: 5, scope: !1081)
!1100 = !DILocation(line: 479, column: 9, scope: !1083)
!1101 = !DILocation(line: 479, column: 17, scope: !1083)
!1102 = !DILocation(line: 479, column: 21, scope: !1083)
!1103 = !DILocation(line: 479, column: 31, scope: !1083)
!1104 = !DILocation(line: 480, column: 13, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1083, file: !195, line: 480, column: 13)
!1106 = !DILocation(line: 480, column: 15, scope: !1105)
!1107 = !DILocation(line: 480, column: 13, scope: !1083)
!1108 = !DILocation(line: 481, column: 13, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !195, line: 480, column: 24)
!1110 = !DILocation(line: 484, column: 13, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1083, file: !195, line: 484, column: 13)
!1112 = !DILocation(line: 484, column: 25, scope: !1111)
!1113 = !DILocation(line: 484, column: 31, scope: !1111)
!1114 = !DILocation(line: 484, column: 28, scope: !1111)
!1115 = !DILocation(line: 484, column: 13, scope: !1083)
!1116 = !DILocation(line: 485, column: 13, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1111, file: !195, line: 484, column: 34)
!1118 = !DILocation(line: 487, column: 5, scope: !1084)
!1119 = !DILocation(line: 487, column: 5, scope: !1083)
!1120 = !DILocation(line: 478, column: 39, scope: !1084)
!1121 = !DILocation(line: 478, column: 5, scope: !1084)
!1122 = distinct !{!1122, !1099, !1123}
!1123 = !DILocation(line: 487, column: 5, scope: !1081)
!1124 = !DILocation(line: 489, column: 12, scope: !1071)
!1125 = !DILocation(line: 489, column: 22, scope: !1071)
!1126 = !DILocation(line: 489, column: 33, scope: !1071)
!1127 = !DILocation(line: 489, column: 5, scope: !1071)
!1128 = !DILocation(line: 490, column: 1, scope: !1071)
!1129 = distinct !DISubprogram(name: "aws_byte_buf_eq_c_str_ignore_case", scope: !195, file: !195, line: 129, type: !1051, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DILocalVariable(name: "buf", arg: 1, scope: !1129, file: !195, line: 129, type: !767)
!1132 = !DILocalVariable(name: "c_str", arg: 2, scope: !1129, file: !195, line: 129, type: !1053)
!1133 = !DILocalVariable(name: "rval", scope: !1129, file: !195, line: 132, type: !96)
!1134 = !DILocation(line: 129, column: 73, scope: !1129)
!1135 = !DILocation(line: 129, column: 96, scope: !1129)
!1136 = !DILocation(line: 132, column: 5, scope: !1129)
!1137 = !DILocation(line: 132, column: 10, scope: !1129)
!1138 = !DILocation(line: 132, column: 48, scope: !1129)
!1139 = !DILocation(line: 132, column: 53, scope: !1129)
!1140 = !DILocation(line: 132, column: 61, scope: !1129)
!1141 = !DILocation(line: 132, column: 66, scope: !1129)
!1142 = !DILocation(line: 132, column: 71, scope: !1129)
!1143 = !DILocation(line: 132, column: 17, scope: !1129)
!1144 = !DILocation(line: 134, column: 12, scope: !1129)
!1145 = !DILocation(line: 135, column: 1, scope: !1129)
!1146 = !DILocation(line: 134, column: 5, scope: !1129)
!1147 = distinct !DISubprogram(name: "aws_array_eq_c_str_ignore_case", scope: !195, file: !195, line: 436, type: !1072, scopeLine: 436, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1148)
!1148 = !{!1149, !1150, !1151, !1152, !1153, !1154, !1156}
!1149 = !DILocalVariable(name: "array", arg: 1, scope: !1147, file: !195, line: 436, type: !944)
!1150 = !DILocalVariable(name: "array_len", arg: 2, scope: !1147, file: !195, line: 436, type: !945)
!1151 = !DILocalVariable(name: "c_str", arg: 3, scope: !1147, file: !195, line: 436, type: !1053)
!1152 = !DILocalVariable(name: "array_bytes", scope: !1147, file: !195, line: 447, type: !151)
!1153 = !DILocalVariable(name: "str_bytes", scope: !1147, file: !195, line: 448, type: !151)
!1154 = !DILocalVariable(name: "i", scope: !1155, file: !195, line: 450, type: !73)
!1155 = distinct !DILexicalBlock(scope: !1147, file: !195, line: 450, column: 5)
!1156 = !DILocalVariable(name: "s", scope: !1157, file: !195, line: 451, type: !104)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !195, line: 450, column: 44)
!1158 = distinct !DILexicalBlock(scope: !1155, file: !195, line: 450, column: 5)
!1159 = !DILocation(line: 436, column: 55, scope: !1147)
!1160 = !DILocation(line: 436, column: 75, scope: !1147)
!1161 = !DILocation(line: 436, column: 104, scope: !1147)
!1162 = !DILocation(line: 447, column: 5, scope: !1147)
!1163 = !DILocation(line: 447, column: 20, scope: !1147)
!1164 = !DILocation(line: 447, column: 34, scope: !1147)
!1165 = !DILocation(line: 448, column: 5, scope: !1147)
!1166 = !DILocation(line: 448, column: 20, scope: !1147)
!1167 = !DILocation(line: 448, column: 49, scope: !1147)
!1168 = !DILocation(line: 450, column: 10, scope: !1155)
!1169 = !DILocation(line: 450, column: 17, scope: !1155)
!1170 = !DILocation(line: 450, column: 24, scope: !1158)
!1171 = !DILocation(line: 450, column: 28, scope: !1158)
!1172 = !DILocation(line: 450, column: 26, scope: !1158)
!1173 = !DILocation(line: 450, column: 5, scope: !1155)
!1174 = !DILocation(line: 451, column: 9, scope: !1157)
!1175 = !DILocation(line: 451, column: 17, scope: !1157)
!1176 = !DILocation(line: 451, column: 21, scope: !1157)
!1177 = !DILocation(line: 451, column: 31, scope: !1157)
!1178 = !DILocation(line: 452, column: 13, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1157, file: !195, line: 452, column: 13)
!1180 = !DILocation(line: 452, column: 15, scope: !1179)
!1181 = !DILocation(line: 452, column: 13, scope: !1157)
!1182 = !DILocation(line: 453, column: 13, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1179, file: !195, line: 452, column: 24)
!1184 = !DILocation(line: 456, column: 29, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1157, file: !195, line: 456, column: 13)
!1186 = !DILocation(line: 456, column: 41, scope: !1185)
!1187 = !DILocation(line: 456, column: 13, scope: !1185)
!1188 = !DILocation(line: 456, column: 64, scope: !1185)
!1189 = !DILocation(line: 456, column: 48, scope: !1185)
!1190 = !DILocation(line: 456, column: 45, scope: !1185)
!1191 = !DILocation(line: 456, column: 13, scope: !1157)
!1192 = !DILocation(line: 457, column: 13, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1185, file: !195, line: 456, column: 68)
!1194 = !DILocation(line: 459, column: 5, scope: !1158)
!1195 = !DILocation(line: 459, column: 5, scope: !1157)
!1196 = !DILocation(line: 450, column: 39, scope: !1158)
!1197 = !DILocation(line: 450, column: 5, scope: !1158)
!1198 = distinct !{!1198, !1173, !1199}
!1199 = !DILocation(line: 459, column: 5, scope: !1155)
!1200 = !DILocation(line: 461, column: 12, scope: !1147)
!1201 = !DILocation(line: 461, column: 22, scope: !1147)
!1202 = !DILocation(line: 461, column: 33, scope: !1147)
!1203 = !DILocation(line: 461, column: 5, scope: !1147)
!1204 = !DILocation(line: 462, column: 1, scope: !1147)
!1205 = distinct !DISubprogram(name: "aws_byte_buf_init_copy_from_cursor", scope: !195, file: !195, line: 137, type: !1206, scopeLine: 140, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1208)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!134, !112, !66, !136}
!1208 = !{!1209, !1210, !1211}
!1209 = !DILocalVariable(name: "dest", arg: 1, scope: !1205, file: !195, line: 138, type: !112)
!1210 = !DILocalVariable(name: "allocator", arg: 2, scope: !1205, file: !195, line: 139, type: !66)
!1211 = !DILocalVariable(name: "src", arg: 3, scope: !1205, file: !195, line: 140, type: !136)
!1212 = !DILocation(line: 138, column: 26, scope: !1205)
!1213 = !DILocation(line: 139, column: 27, scope: !1205)
!1214 = !DILocation(line: 140, column: 28, scope: !1205)
!1215 = !DILocation(line: 143, column: 5, scope: !1205)
!1216 = !DILocation(line: 143, column: 5, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1218, file: !195, line: 143, column: 5)
!1218 = distinct !DILexicalBlock(scope: !1205, file: !195, line: 143, column: 5)
!1219 = !DILocation(line: 143, column: 5, scope: !1218)
!1220 = !DILocation(line: 143, column: 5, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1217, file: !195, line: 143, column: 5)
!1222 = !DILocation(line: 145, column: 5, scope: !1205)
!1223 = !DILocation(line: 145, column: 5, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1205, file: !195, line: 145, column: 5)
!1225 = !DILocation(line: 147, column: 25, scope: !1205)
!1226 = !DILocation(line: 147, column: 29, scope: !1205)
!1227 = !DILocation(line: 147, column: 20, scope: !1205)
!1228 = !DILocation(line: 147, column: 63, scope: !1205)
!1229 = !DILocation(line: 147, column: 78, scope: !1205)
!1230 = !DILocation(line: 147, column: 47, scope: !1205)
!1231 = !DILocation(line: 147, column: 5, scope: !1205)
!1232 = !DILocation(line: 147, column: 11, scope: !1205)
!1233 = !DILocation(line: 147, column: 18, scope: !1205)
!1234 = !DILocation(line: 148, column: 13, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1205, file: !195, line: 148, column: 9)
!1236 = !DILocation(line: 148, column: 17, scope: !1235)
!1237 = !DILocation(line: 148, column: 22, scope: !1235)
!1238 = !DILocation(line: 148, column: 25, scope: !1235)
!1239 = !DILocation(line: 148, column: 31, scope: !1235)
!1240 = !DILocation(line: 148, column: 38, scope: !1235)
!1241 = !DILocation(line: 148, column: 9, scope: !1205)
!1242 = !DILocation(line: 149, column: 9, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1235, file: !195, line: 148, column: 47)
!1244 = !DILocation(line: 152, column: 21, scope: !1205)
!1245 = !DILocation(line: 152, column: 5, scope: !1205)
!1246 = !DILocation(line: 152, column: 11, scope: !1205)
!1247 = !DILocation(line: 152, column: 15, scope: !1205)
!1248 = !DILocation(line: 153, column: 26, scope: !1205)
!1249 = !DILocation(line: 153, column: 5, scope: !1205)
!1250 = !DILocation(line: 153, column: 11, scope: !1205)
!1251 = !DILocation(line: 153, column: 20, scope: !1205)
!1252 = !DILocation(line: 154, column: 23, scope: !1205)
!1253 = !DILocation(line: 154, column: 5, scope: !1205)
!1254 = !DILocation(line: 154, column: 11, scope: !1205)
!1255 = !DILocation(line: 154, column: 21, scope: !1205)
!1256 = !DILocation(line: 155, column: 13, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1205, file: !195, line: 155, column: 9)
!1258 = !DILocation(line: 155, column: 17, scope: !1257)
!1259 = !DILocation(line: 155, column: 9, scope: !1205)
!1260 = !DILocation(line: 156, column: 9, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1257, file: !195, line: 155, column: 22)
!1262 = !DILocation(line: 157, column: 5, scope: !1261)
!1263 = !DILocation(line: 159, column: 5, scope: !1205)
!1264 = !DILocation(line: 160, column: 1, scope: !1205)
!1265 = distinct !DISubprogram(name: "aws_byte_buf_init_cache_and_update_cursors", scope: !195, file: !195, line: 162, type: !1266, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1268)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!134, !112, !66, null}
!1268 = !{!1269, !1270, !1271, !1272, !1276}
!1269 = !DILocalVariable(name: "dest", arg: 1, scope: !1265, file: !195, line: 162, type: !112)
!1270 = !DILocalVariable(name: "allocator", arg: 2, scope: !1265, file: !195, line: 162, type: !66)
!1271 = !DILocalVariable(name: "total_len", scope: !1265, file: !195, line: 168, type: !73)
!1272 = !DILocalVariable(name: "args", scope: !1265, file: !195, line: 169, type: !1273)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1274, line: 14, baseType: !1275)
!1274 = !DIFile(filename: "src/clang-10.0.1.src/install-release/lib/clang/10.0.1/include/stdarg.h", directory: "/Users/jorge")
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 169, baseType: !61)
!1276 = !DILocalVariable(name: "cursor_i", scope: !1265, file: !195, line: 173, type: !135)
!1277 = !DILocation(line: 162, column: 69, scope: !1265)
!1278 = !DILocation(line: 162, column: 97, scope: !1265)
!1279 = !DILocation(line: 166, column: 5, scope: !1265)
!1280 = !DILocation(line: 166, column: 5, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1265, file: !195, line: 166, column: 5)
!1282 = !DILocation(line: 168, column: 5, scope: !1265)
!1283 = !DILocation(line: 168, column: 12, scope: !1265)
!1284 = !DILocation(line: 169, column: 5, scope: !1265)
!1285 = !DILocation(line: 169, column: 13, scope: !1265)
!1286 = !DILocation(line: 170, column: 5, scope: !1265)
!1287 = !DILocation(line: 173, column: 5, scope: !1265)
!1288 = !DILocation(line: 173, column: 29, scope: !1265)
!1289 = !DILocation(line: 174, column: 5, scope: !1265)
